Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 15, 15, 96)        34944
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 96)          0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 265)         636265
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 4, 265)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 384)         916224
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 4, 384)         1327488
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 4, 256)         884992
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 2, 2, 256)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 1024)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600
_________________________________________________________________
dense_2 (Dense)              (None, 512)               524800
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 2565
=================================================================
Total params: 5,376,878
Trainable params: 5,376,878
Non-trainable params: 0
_________________________________________________________________


